from item.item import Item

# 整个道具完成情况：()

#########################
# 填入名称 完成情况：()
NAME_IN_USERITEM = "itemTemplate"
#########################

#########################
# 填入id 完成情况：()
ID = -1
#########################

#########################
# 在 itemRegistor 注册该类 完成情况: ()
# 在 item_table 注册该类 完成情况: ()
#########################

class itemTemplate(Item): # 修改类名 完成情况：()
    item_id = ID
    #########################
    # 在此处定义其他全局成员 完成情况：()
    #########################
    
    def __init__(self, user_id:int):
        super(itemTemplate, self).__init__(user_id=user_id, item_id=ID) # 修改类名 完成情况：()
        
        #########################
        # 在此处定义其他成员 完成情况：()
        #########################
        self._update()
    
    def _update(self):
        super()._update()
        #########################
        # 在此处定义全体成员的更新 完成情况：()
        #########################
        
    def use(self, num):
        enough = self.isEnough(num)
        
        msg = super().use(num)
        if not enough:
            return msg
        
        #########################
        # 在此处定义道具使用的方式 完成情况：()
        #########################
        
        return msg
    
    @classmethod
    def describe(self): # 添加描述 完成情况：()
        msg = ""
        #########################
        # 在此处定义道具的描述 完成情况：()
        #########################
        return msg
    
    #########################
    # 在此处定义道具的其他行为 完成情况：()
    #########################
    